In [1]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
x = [[1,5,1],[2,np.nan,2],[np.nan,np.nan,3]]
df = pd.DataFrame(x,index=['CA','NV','AZ'],columns=['a','b','c'])
print(df)

      a    b  c
CA  1.0  5.0  1
NV  2.0  NaN  2
AZ  NaN  NaN  3

In [4]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States']="CA NV AZ".split()
df.set_index('States',inplace=True)
print(df)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [6]:
# Dropping any rows with a NaN value
print(df.dropna(axis=0))

      a    b  c
CA  1.0  5.0  1

In [7]:
# Dropping any columns with NaN value
print(df.dropna(axis=1))

    c
CA  1
NV  2
AZ  3

In [8]:
# Dropping a row but keeping minimum 2 non-NaN values using 'thresh' parameter
print(df.dropna(axis=0,thresh=2))

      a    b  c
CA  1.0  5.0  1
NV  2.0  NaN  2

In [23]:
# 'thresh' parameter is related to non-NaN values
print(df.dropna(axis=0,thresh=3))

      a    b  c
CA  1.0  5.0  1

In [24]:
# Filling values with a default value
print(df.fillna(value='FILL VALUE'))

             a           b  c
CA           1           5  1
NV           2  FILL VALUE  2
AZ  FILL VALUE  FILL VALUE  3

In [26]:
# Filling NaN values with mean of 'a'
print(df.fillna(value=df['a'].mean()))

      a    b  c
CA  1.0  5.0  1
NV  2.0  1.5  2
AZ  1.5  1.5  3

In [27]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [28]:
# Grouping by 'Company' column and listing mean sales
byComp = df.groupby('Company')
print(byComp.mean())

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [29]:
# Grouping by 'Company' column and listing sum of sales
print(byComp.sum())

         Sales
Company
FB         593
GOOG       320
MSFT       464